package com.company.rpg;

public class res {
    public static void TwoLine() {  System.out.println(TwoLine);}
    public static void OneLine() {  System.out.println(OneLine);}

    public final static String TwoLine =  "============================================";
    public final static String OneLine =  "____________________________________________";
    public final static String InputError = //Ввод неверных данных
            "Такого варианта нет или выбор введён неверно"+"\n"+
            "Попробуйте снова"+"\n"+
            "____________________________________________";
    public final static String Start = //первые строки при входе в игу
            "Добро пожаловать в РПГ игру,"+"\n"+
            "Сдесь вы окунётесь в мир магии и приключений"+"\n"+
            "============================================";
    public final static String Start_1 = //выбор создать или продолжить игру
            "Начать новую игру или продолжить старую?"+"\n"+
            "1) Начать новую   2) Загрузить не законченую" +"\n"+
            "____________________________________________";
    public final static String SwitchRace = //выбор рассы
            "Выбирете одну из трёх расс:"+"\n"+
            "1) Эльф 2) Человек 3) Дварф"+"\n"+
            "____________________________________________";
    public final static String SwitchClass = //выбор рассы
            "Выбирете класс персонажа:"+"\n"+
            "1) Маг 2) Воин"+"\n"+
            "____________________________________________";
    public final static String StartGame = //первые строки при входе в игу
            "Создай себе персонажа с которым,"+"\n"+
                    "Ты пройдёшь все приключения этого мира"+"\n"+
                    "============================================";
<<<<<<< HEAD
    public final static String InTown= //первые строки при входе в игу
            "1) Сохронить и выйти 2) Пойти изучать подземелья\n3) Отправится на задание 4) Показать характеристики\n5) Купить зелье здоровья 6) ";

        /*public final static String StartStory = //начало истории
=======
    /*public final static String StartStory = //начало истории
>>>>>>> master
            "Вы создали своего персонажа"+"\n"+
                    ""+"\n"+
                    "============================================";
    */

}
